common/components/MemberHelpers.php

    public static function customMemberForm($memberFieldId,$type = '1'){

        if($type == '1'){
            // Ambil Data MembersForm Berdasarkan Jenis Perpustakaan
            $membersForm = \common\models\base\MembersForm::find()
                        ->where(['Jenis_Perpustakaan_id' => Yii::$app->config->get('JenisPerpustakaan')])
                        ->andWhere(['Member_Field_id' => $memberFieldId])
                        ->asArray()->all();

        }else if($type == '2'){
             // Ambil Data MembersOnline Berdasarkan Jenis Perpustakaan
            $membersForm = \common\models\base\MembersOnlineForm::find()
                        ->where(['Jenis_Perpustakaan_id' => Yii::$app->config->get('JenisPerpustakaan')])
                        ->andWhere(['Member_Field_id' => $memberFieldId])
                        ->asArray()->all();
        }else if($type == '3'){
             // Ambil Data MembersForm Berdasarkan Jenis Perpustakaan
            $membersForm = \common\models\base\MembersFormList::find()
                        ->where(['Jenis_Perpustakaan_id' => Yii::$app->config->get('JenisPerpustakaan')])
                        ->andWhere(['Member_Field_id' => $memberFieldId])
                        ->asArray()->all();
---
SELECT * FROM `members_form_list` WHERE (`Jenis_Perpustakaan_id`='7') AND (`Member_Field_id`=1)