backend/views/site/index.php

SELECT * FROM `jenis_perpustakaan` WHERE `ID`='7'
---
		<div class="col-md-12">
			<h4 class="page-header">
				<?= yii::t('app','Jenis Perpustakaan : ')?> <?php
				$jenisPerpustakaan = \common\models\JenisPerpustakaan::findOne(Yii::$app->config->get('JenisPerpustakaan'));

SELECT COUNT(*) FROM `catalogs`
---
			<div class="col-md-3 col-sm-6 col-xs-12">

				<?php
				$count = (new \yii\db\Query())
					->from('catalogs')
					->count();

SELECT COUNT(*) FROM `catalogfiles`
---
			<div class="col-md-3 col-sm-6 col-xs-12">

				<?php
				$count = (new \yii\db\Query())
					->from('catalogfiles')
					->count();

SELECT COUNT(*) FROM `collections`
---

			<div class="col-md-3 col-sm-6 col-xs-12">
				<?php
				$count = (new \yii\db\Query())
					->from('collections')
					->count();

SELECT COUNT(*) FROM `members`
---
			<div class="col-md-3 col-sm-6 col-xs-12">
			<!-- ANGGOTA -->
				<?php
				$count = (new \yii\db\Query())
					->from('members')
					->count();

SELECT COUNT(*) FROM `memberguesses` WHERE NOT (`NoAnggota` IS NULL)
SELECT COUNT(*) FROM `memberguesses` WHERE `NoAnggota` IS NULL
---
							  ]);*/?>
				<?php

				$anggota = (new \yii\db\Query())
					->from('memberguesses')
					->where(['not', ['NoAnggota' => null]])
					->count();

				$nonAnggota = (new \yii\db\Query())
					->from('memberguesses')
					->where(['NoAnggota' => null])
					->count();

SELECT COUNT(*) FROM `bacaditempat`
---
				$query = (new \yii\db\Query())
					->from('bacaditempat')
					->select('bacaditempat.ID');
				$countPeminjamanReturn = $query->count();

SELECT COUNT(*) FROM (SELECT `bacaditempat`.`ID` FROM `bacaditempat` WHERE NOT (`bacaditempat`.`Member_id` IS NULL) GROUP BY `bacaditempat`.`Member_id`) `c`
---
					->where(['not', ['bacaditempat.Member_id' => null]])
					->groupBy('bacaditempat.Member_id');

				$anggotabacaditempat = $query->count();

SELECT COUNT(*) FROM (SELECT `bacaditempat`.`ID` FROM `bacaditempat` WHERE `bacaditempat`.`Member_id` IS NULL GROUP BY `bacaditempat`.`NoPengunjung`) `c`
---
					->where(['bacaditempat.Member_id' => null])
					->groupBy('bacaditempat.NoPengunjung');

				$nonanggotabacaditempat = $query->count();