backend/modules/pengkatalogan/views/katalog/_entryBibliografiSimple.php

SELECT * FROM `kata_sandang`
---
                                      echo Select2::widget([
                                      'model' => $modelbib,
                                      'attribute' => 'KataSandang',
                                      'data'=>ArrayHelper::map(KataSandang::find()->all(),'JumlahKarakter','Name'),